# Module 5 - Limpeza e preparação de dados

## 5.1 Identificando e tratando dados ausentes

### Identificando dados ausentes

In [275]:
import pandas as pd
import numpy as np

In [276]:
# construindo um dataframe
df = pd.DataFrame(
    np.random.rand(9, 4) * 100,
    index=[chr(i) for i in range(ord("A"), ord("J"))],
    columns=["coluna%s" %i for i in range(1, 5)]
)
df_2 = df.copy()
df

     coluna1    coluna2    coluna3    coluna4
A  14.308885  83.945056  62.665650  57.094375
B  97.685728  81.386227   0.640309  92.422950
C  26.815882  44.058048  78.066158  87.725544
D   5.665074  40.272822  43.815550  14.279994
E  26.865925  62.518426  26.111652  20.348160
F  16.520460  22.782855   6.839882  44.240250
G  41.384006  17.219668  82.067829  69.175445
H  49.789975  32.919057  63.920339  21.715674
I   7.857699  97.247270  19.424911  15.385715

In [277]:
# tipos das colunas
df.dtypes

coluna1    float64
coluna2    float64
coluna3    float64
coluna4    float64
dtype: object

In [278]:
df['coluna1'] = df['coluna1'].astype(int)
df.dtypes

coluna1      int64
coluna2    float64
coluna3    float64
coluna4    float64
dtype: object

In [279]:
df['coluna3'] = df['coluna3'].astype(str)
df.dtypes

coluna1      int64
coluna2    float64
coluna3     object
coluna4    float64
dtype: object

In [280]:
df

   coluna1    coluna2             coluna3    coluna4
A       14  83.945056   62.66564957600629  57.094375
B       97  81.386227  0.6403087221096837  92.422950
C       26  44.058048   78.06615831951159  87.725544
D        5  40.272822   43.81554982329776  14.279994
E       26  62.518426  26.111651696329584  20.348160
F       16  22.782855   6.839881549393856  44.240250
G       41  17.219668   82.06782906181452  69.175445
H       49  32.919057   63.92033885250675  21.715674
I        7  97.247270   19.42491121251925  15.385715

In [281]:
# acessando valor por linha e coluna
df.iloc[4, 2]

'26.111651696329584'

In [282]:
# inserindo um dado faltante no dataframe
df.iloc[1, 0] = np.nan
df.iloc[4, 0] = np.nan
df.iloc[3, 0] = np.nan
df.iloc[8, 0] = np.nan
df.iloc[6, 3] = np.nan
df.iloc[4, 3] = np.nan

In [283]:
# NaN = Not a Number
df

   coluna1    coluna2             coluna3    coluna4
A     14.0  83.945056   62.66564957600629  57.094375
B      NaN  81.386227  0.6403087221096837  92.422950
C     26.0  44.058048   78.06615831951159  87.725544
D      NaN  40.272822   43.81554982329776  14.279994
E      NaN  62.518426  26.111651696329584        NaN
F     16.0  22.782855   6.839881549393856  44.240250
G     41.0  17.219668   82.06782906181452        NaN
H     49.0  32.919057   63.92033885250675  21.715674
I      NaN  97.247270   19.42491121251925  15.385715

In [284]:
# identificando valores faltantes
df.isna()
df.isnull()

   coluna1  coluna2  coluna3  coluna4
A    False    False    False    False
B     True    False    False    False
C    False    False    False    False
D     True    False    False    False
E     True    False    False     True
F    False    False    False    False
G    False    False    False     True
H    False    False    False    False
I     True    False    False    False

In [285]:
# identificando apenas de uma coluna
df.coluna1.isna()

A    False
B     True
C    False
D     True
E     True
F    False
G    False
H    False
I     True
Name: coluna1, dtype: bool

In [286]:
# trazer todas as linhas onde a coluna é NaN
df[df.coluna1.isna()]

   coluna1    coluna2             coluna3    coluna4
B      NaN  81.386227  0.6403087221096837  92.422950
D      NaN  40.272822   43.81554982329776  14.279994
E      NaN  62.518426  26.111651696329584        NaN
I      NaN  97.247270   19.42491121251925  15.385715

In [287]:
# trazer todas as linhas onde a coluna não é NaN
df[~df.coluna1.isna()]

   coluna1    coluna2            coluna3    coluna4
A     14.0  83.945056  62.66564957600629  57.094375
C     26.0  44.058048  78.06615831951159  87.725544
F     16.0  22.782855  6.839881549393856  44.240250
G     41.0  17.219668  82.06782906181452        NaN
H     49.0  32.919057  63.92033885250675  21.715674

In [288]:
# identificando a quantidade de valores NaN em uma coluna
df.coluna1.isna().sum()

4

In [289]:
# identificando a quantidade de valores NaN no dataframe
# true = 1
# false = 0
df.isna().sum()

coluna1    4
coluna2    0
coluna3    0
coluna4    2
dtype: int64

In [290]:
# len(df.index) -> quantidade de linhas de um dataframe
# cáculo para saber a porcentagem de valores faltantes em cada coluna

df.isna().sum() / len(df.index)

coluna1    0.444444
coluna2    0.000000
coluna3    0.000000
coluna4    0.222222
dtype: float64

### Tratando dados ausentes

In [291]:
df['coluna1']

A    14.0
B     NaN
C    26.0
D     NaN
E     NaN
F    16.0
G    41.0
H    49.0
I     NaN
Name: coluna1, dtype: float64

In [292]:
# subistituindo por zero

df['coluna1'].fillna(0)

A    14.0
B     0.0
C    26.0
D     0.0
E     0.0
F    16.0
G    41.0
H    49.0
I     0.0
Name: coluna1, dtype: float64

In [293]:
# subistituindo pela media
mean = df['coluna1'].mean() # média

df['coluna1'].fillna(mean)

A    14.0
B    29.2
C    26.0
D    29.2
E    29.2
F    16.0
G    41.0
H    49.0
I    29.2
Name: coluna1, dtype: float64

In [294]:
# subistituindo pela mediana

median = df['coluna1'].sort_values().median()

df['coluna1'].fillna(median)

A    14.0
B    26.0
C    26.0
D    26.0
E    26.0
F    16.0
G    41.0
H    49.0
I    26.0
Name: coluna1, dtype: float64

### Subistituindo usando ffill e o bfill

In [295]:
df['coluna1']

A    14.0
B     NaN
C    26.0
D     NaN
E     NaN
F    16.0
G    41.0
H    49.0
I     NaN
Name: coluna1, dtype: float64

In [296]:
# pega o valor de cima e aplica para os de baixo
df['coluna1'].fillna(method='ffill')

A    14.0
B    14.0
C    26.0
D    26.0
E    26.0
F    16.0
G    41.0
H    49.0
I    49.0
Name: coluna1, dtype: float64

In [297]:
# pega o valor de baixo e aplica para os de cima
df['coluna1'].fillna(method='bfill')

A    14.0
B    26.0
C    26.0
D    16.0
E    16.0
F    16.0
G    41.0
H    49.0
I     NaN
Name: coluna1, dtype: float64

### Dropando as linhas com missing

In [298]:
# dropando todas as linhas que contem valores NaN
df.dropna()

   coluna1    coluna2            coluna3    coluna4
A     14.0  83.945056  62.66564957600629  57.094375
C     26.0  44.058048  78.06615831951159  87.725544
F     16.0  22.782855  6.839881549393856  44.240250
H     49.0  32.919057  63.92033885250675  21.715674

### Dados Duplicados

In [299]:
# criando um dataframe com dados duplicados

df_dup = df.append(df.loc['D': 'H',:]).sort_index()
df_dup

/var/folders/wh/_2xtz5kd2knd10y0m8tmqhrc0000gp/T/ipykernel_17759/400415149.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_dup = df.append(df.loc['D': 'H',:]).sort_index()

   coluna1    coluna2             coluna3    coluna4
A     14.0  83.945056   62.66564957600629  57.094375
B      NaN  81.386227  0.6403087221096837  92.422950
C     26.0  44.058048   78.06615831951159  87.725544
D      NaN  40.272822   43.81554982329776  14.279994
D      NaN  40.272822   43.81554982329776  14.279994
E      NaN  62.518426  26.111651696329584        NaN
E      NaN  62.518426  26.111651696329584        NaN
F     16.0  22.782855   6.839881549393856  44.240250
F     16.0  22.782855   6.839881549393856  44.240250
G     41.0  17.219668   82.06782906181452        NaN
G     41.0  17.219668   82.06782906181452        NaN
H     49.0  32.919057   63.92033885250675  21.715674
H     49.0  32.919057   63.92033885250675  21.715674
I      NaN  97.247270   19.42491121251925  15.385715

In [300]:
# dropando todas as linhas duplicadas
df_dup.drop_duplicates()

   coluna1    coluna2             coluna3    coluna4
A     14.0  83.945056   62.66564957600629  57.094375
B      NaN  81.386227  0.6403087221096837  92.422950
C     26.0  44.058048   78.06615831951159  87.725544
D      NaN  40.272822   43.81554982329776  14.279994
E      NaN  62.518426  26.111651696329584        NaN
F     16.0  22.782855   6.839881549393856  44.240250
G     41.0  17.219668   82.06782906181452        NaN
H     49.0  32.919057   63.92033885250675  21.715674
I      NaN  97.247270   19.42491121251925  15.385715

In [301]:
# dropando valores duplicados por analisando uma coluna
df_dup.drop_duplicates(subset=['coluna1'])

   coluna1    coluna2             coluna3    coluna4
A     14.0  83.945056   62.66564957600629  57.094375
B      NaN  81.386227  0.6403087221096837  92.422950
C     26.0  44.058048   78.06615831951159  87.725544
F     16.0  22.782855   6.839881549393856  44.240250
G     41.0  17.219668   82.06782906181452        NaN
H     49.0  32.919057   63.92033885250675  21.715674

### Mapeamentos (map)

In [302]:
# lista randomica de 0 ou 1 de quinze digitos

rand_list = [np.random.randint(0, 2) for i in range(0, 15)]

In [303]:
genero = pd.Series(rand_list)
genero

0     0
1     0
2     0
3     0
4     0
5     0
6     1
7     0
8     1
9     1
10    1
11    0
12    1
13    0
14    0
dtype: int64

In [304]:
# passa um dicionario para a série e troca os valores mapeados para o valor escolhido
genero.map({1: 'Feminino', 0: 'Masculino'})

0     Masculino
1     Masculino
2     Masculino
3     Masculino
4     Masculino
5     Masculino
6      Feminino
7     Masculino
8      Feminino
9      Feminino
10     Feminino
11    Masculino
12     Feminino
13    Masculino
14    Masculino
dtype: object

## 5.2 Renomeando indices e colunas

### Renomeando colunas

In [305]:
# lista de colunas
df_2.columns

Index(['coluna1', 'coluna2', 'coluna3', 'coluna4'], dtype='object')

In [306]:
df_2.columns = ['segunda', 'terca', 'quarta', 'quinta']
df_2

     segunda      terca     quarta     quinta
A  14.308885  83.945056  62.665650  57.094375
B  97.685728  81.386227   0.640309  92.422950
C  26.815882  44.058048  78.066158  87.725544
D   5.665074  40.272822  43.815550  14.279994
E  26.865925  62.518426  26.111652  20.348160
F  16.520460  22.782855   6.839882  44.240250
G  41.384006  17.219668  82.067829  69.175445
H  49.789975  32.919057  63.920339  21.715674
I   7.857699  97.247270  19.424911  15.385715

### Renomeando indices

In [307]:
# criando a coluna com os novos indices
list_index = ["LETRA_" + chr(i) for i in range(ord("A"), ord("J"))]

df_2['coluna_index'] = list_index
df_2

     segunda      terca     quarta     quinta coluna_index
A  14.308885  83.945056  62.665650  57.094375      LETRA_A
B  97.685728  81.386227   0.640309  92.422950      LETRA_B
C  26.815882  44.058048  78.066158  87.725544      LETRA_C
D   5.665074  40.272822  43.815550  14.279994      LETRA_D
E  26.865925  62.518426  26.111652  20.348160      LETRA_E
F  16.520460  22.782855   6.839882  44.240250      LETRA_F
G  41.384006  17.219668  82.067829  69.175445      LETRA_G
H  49.789975  32.919057  63.920339  21.715674      LETRA_H
I   7.857699  97.247270  19.424911  15.385715      LETRA_I

In [308]:
# setando a coluna criada como a coluna index
df_2.set_index('coluna_index')

                segunda      terca     quarta     quinta
coluna_index
LETRA_A       14.308885  83.945056  62.665650  57.094375
LETRA_B       97.685728  81.386227   0.640309  92.422950
LETRA_C       26.815882  44.058048  78.066158  87.725544
LETRA_D        5.665074  40.272822  43.815550  14.279994
LETRA_E       26.865925  62.518426  26.111652  20.348160
LETRA_F       16.520460  22.782855   6.839882  44.240250
LETRA_G       41.384006  17.219668  82.067829  69.175445
LETRA_H       49.789975  32.919057  63.920339  21.715674
LETRA_I        7.857699  97.247270  19.424911  15.385715

In [309]:
# reseta o index e dropa a coluna que era index antes
df_2.reset_index(drop=True)

     segunda      terca     quarta     quinta coluna_index
0  14.308885  83.945056  62.665650  57.094375      LETRA_A
1  97.685728  81.386227   0.640309  92.422950      LETRA_B
2  26.815882  44.058048  78.066158  87.725544      LETRA_C
3   5.665074  40.272822  43.815550  14.279994      LETRA_D
4  26.865925  62.518426  26.111652  20.348160      LETRA_E
5  16.520460  22.782855   6.839882  44.240250      LETRA_F
6  41.384006  17.219668  82.067829  69.175445      LETRA_G
7  49.789975  32.919057  63.920339  21.715674      LETRA_H
8   7.857699  97.247270  19.424911  15.385715      LETRA_I

## 5.3 Categorização e dummies

### Categorização

In [310]:
df_imc = pd.DataFrame({
    'nome': ['Fernando', 'Maria', 'Felipe', 'Pedro', 'Bianca', 'Beatriz', 'Patricia', 'Lucia'],
    'imc': [27, 26, 25, 16, 16.7, 17.5, 18.6, 24]
})
df_imc

       nome   imc
0  Fernando  27.0
1     Maria  26.0
2    Felipe  25.0
3     Pedro  16.0
4    Bianca  16.7
5   Beatriz  17.5
6  Patricia  18.6
7     Lucia  24.0

In [311]:
# categorizando pelo imc
df_imc.loc[df_imc['imc'] <= 16.9, 'imc_cat'] = 'muito_abaixo'
df_imc.loc[(df_imc['imc'] > 17) & (df_imc['imc'] <= 18.4), 'imc_cat'] = 'abaixo'
df_imc.loc[(df_imc['imc'] > 18.5) & (df_imc['imc'] <= 24.9), 'imc_cat'] = 'normal'
df_imc.loc[df_imc['imc'] >= 25, 'imc_cat'] = 'acima'

In [312]:
df_imc

       nome   imc       imc_cat
0  Fernando  27.0         acima
1     Maria  26.0         acima
2    Felipe  25.0         acima
3     Pedro  16.0  muito_abaixo
4    Bianca  16.7  muito_abaixo
5   Beatriz  17.5        abaixo
6  Patricia  18.6        normal
7     Lucia  24.0        normal

In [313]:
# nova categorizacao pela coluna criada
df_imc.loc[df_imc['imc_cat'] == 'normal', 'imc_cat_2'] = 'saudavel'
df_imc.loc[df_imc['imc_cat'] != 'normal', 'imc_cat_2'] = 'nao_saudavel'

In [314]:
df_imc

       nome   imc       imc_cat     imc_cat_2
0  Fernando  27.0         acima  nao_saudavel
1     Maria  26.0         acima  nao_saudavel
2    Felipe  25.0         acima  nao_saudavel
3     Pedro  16.0  muito_abaixo  nao_saudavel
4    Bianca  16.7  muito_abaixo  nao_saudavel
5   Beatriz  17.5        abaixo  nao_saudavel
6  Patricia  18.6        normal      saudavel
7     Lucia  24.0        normal      saudavel

In [315]:
# ordenando por quartis

df_imc['imc'].sort_values()

3    16.0
4    16.7
5    17.5
6    18.6
7    24.0
2    25.0
1    26.0
0    27.0
Name: imc, dtype: float64

In [316]:
df_imc['imc'].quantile([0.25, 0.5, 0.75])

0.25    17.30
0.50    21.30
0.75    25.25
Name: imc, dtype: float64

In [317]:
df_imc.loc[df_imc['imc'] <= 17.3, 'imc_cat_3'] = '1o_quartil'
df_imc.loc[(df_imc['imc'] > 17.30) & (df_imc['imc'] <= 21.30), 'imc_cat_3'] = '2o_quartil'
df_imc.loc[(df_imc['imc'] > 21.30) & (df_imc['imc'] <= 25.25), 'imc_cat_3'] = '3o_quartil'
df_imc.loc[df_imc['imc'] > 25.25, 'imc_cat_3'] = '4o_quartil'

In [318]:
df_imc

       nome   imc       imc_cat     imc_cat_2   imc_cat_3
0  Fernando  27.0         acima  nao_saudavel  4o_quartil
1     Maria  26.0         acima  nao_saudavel  4o_quartil
2    Felipe  25.0         acima  nao_saudavel  3o_quartil
3     Pedro  16.0  muito_abaixo  nao_saudavel  1o_quartil
4    Bianca  16.7  muito_abaixo  nao_saudavel  1o_quartil
5   Beatriz  17.5        abaixo  nao_saudavel  2o_quartil
6  Patricia  18.6        normal      saudavel  2o_quartil
7     Lucia  24.0        normal      saudavel  3o_quartil

### Construindo dummies

In [319]:
# cria novas colunas a partir das variáveis categoricas
pd.get_dummies(df_imc['imc_cat_2'])

   nao_saudavel  saudavel
0             1         0
1             1         0
2             1         0
3             1         0
4             1         0
5             1         0
6             0         1
7             0         1

In [320]:
dummies = pd.get_dummies(df_imc['imc_cat'])
dummies

   abaixo  acima  muito_abaixo  normal
0       0      1             0       0
1       0      1             0       0
2       0      1             0       0
3       0      0             1       0
4       0      0             1       0
5       1      0             0       0
6       0      0             0       1
7       0      0             0       1

In [321]:
# inserindo as novas colunas criadas no dataframe
df_imc = pd.concat([df_imc, dummies], axis=1)

In [322]:
df_imc

,nome,imc,imc_cat,imc_cat_2,imc_cat_3,abaixo,acima,muito_abaixo,normal
0,Fernando,27.0,acima,nao_saudavel,4o_quartil,0,1,0,0
1,Maria,26.0,acima,nao_saudavel,4o_quartil,0,1,0,0
2,Felipe,25.0,acima,nao_saudavel,3o_quartil,0,1,0,0
3,Pedro,16.0,muito_abaixo,nao_saudavel,1o_quartil,0,0,1,0
4,Bianca,16.7,muito_abaixo,nao_saudavel,1o_quartil,0,0,1,0
5,Beatriz,17.5,abaixo,nao_saudavel,2o_quartil,1,0,0,0
6,Patricia,18.6,normal,saudavel,2o_quartil,0,0,0,1
7,Lucia,24.0,normal,saudavel,3o_quartil,0,0,0,1

## 5.4 Amostragem

In [323]:
columns_list = [chr(i) for i in range(ord("A"), ord("K"))]

df = pd.DataFrame(np.random.randint(100000, size=(1000000, 10)), columns=columns_list)

In [324]:
print(df.shape)
df.head(5)

(1000000, 10)

       A      B      C      D      E      F      G      H      I      J
0   5514  92935  66019  35827  71026  86098  34600  53506  30933  48058
1  63053  81074  15307  87777  33528  72491  93677  16598  42430  49849
2  95376  32778  88790  95687  86809  93907  14705  56283  36859  71466
3  22572  85223  71369  59033  57207  32568  63851   9345  80450  76081
4   1366   5821  38945  48635  18510  40195  90648   4299  61067  39290

In [325]:
df.tail(5)

            A      B      C      D      E      F      G      H      I      J
999995  13485  93072  86791  55704  49365  95221  18915  38588  57305   2523
999996  65947  44223  44927  53445  71516  68172  41790  65415  67204  31076
999997   9719  20144  42184  63044  65666  67773  39545  36322  83543  50038
999998  88280  76992  52858  49596  16038  19399  56607  27363  99111  22688
999999  78540  49387  81861   6844  64653  42941    509  93227  63265  11401

### Retornando uma amostragem dos dados

In [326]:
# método para retornar uma amostragem dos dados
df.sample(10)

            A      B      C      D      E      F      G      H      I      J
879881  43550  52269  67988  84033  45207   5649  78917  37212  40307  95858
819665  39003  85493  20369  12030  84654  95259  49328    790  65904  30142
602484   3502  26537  80225   2857  85470  83249  86065  24186  11017  81499
212389  16222  17787  69388  80157  82754  48078  32423  88943  49324  30386
712217  80950  76719  78682  81688  87153  88560  81497  33560  64598  31473
946783  91550  60236  75047  64911  98917  44581  88981  66190  90042  27811
564744  38302  27372   5675  45185  49994  50509  40429  11898  12954  28602
214562  52580  36868  94699  38921  73664  80755   9833  74146  35223  37222
332408  23013  40725  42696   3773  42794  61021   9549   6170  70262  56049
185540  85642   6633  53213   7648    188  56430   3774  64690  70033  53229

In [327]:
# método para retornar uma amostragem dos dados por fração
df.sample(frac=0.1)

            A      B      C      D      E      F      G      H      I      J
881300  46950  33272  16770   2002  68479  64065  13304  88261  60136  64790
914683  46732  72404  64139  98474  50544  27167  11227  65307  71493  63913
498616  35105   4690  17775  14494  81434  71029  57377  67159  50066  95358
173217  20639  89292  60145  36327  92786  97822  19873  88501  33677  50434
485055  74068  88298  72203   6561  95850  25199  82869  28768  42043  39800
...       ...    ...    ...    ...    ...    ...    ...    ...    ...    ...
83522    3689  63054  60558  18829  28715  27222  45009  75410  62504  76967
385766  12756  18173  58366  77895  14862  94877  97559  31794  69855  92570
137998  81171  29473  56459  30209  94235  19209  12403  63138  25658  13164
648427  24267  20337  86270  87471   3936  11436   5728  73097  11211  76349
613015   7643  49850  77692  77949  56250  41944  52000  56312  19534  16263

[100000 rows x 10 columns]

In [328]:
# random_state retorna sempre a mesma amostragem de dados de um dataframe
# caso algum resultado não possa ser alterado na análise
df.sample(10, random_state=100)

            A      B      C      D      E      F      G      H      I      J
617759  69583   5396  80328  62793  63998  84434  24388   9146   7937  42798
693227  63866   6122  15394  73828  12817  33635  99081  96846   2088  42728
906065  50740  66280  31003  30191  71886  87517   9132   1250  34774  40339
828507  57602  90224  82246  11165  55871  86800  36334  48329  23928  98664
869730  71028  12893  94006  37534  25039  85762   1903  77524  50569  26331
147081  28491  28007  71972   2617  45998  22009  80069  70273  89104  62618
779428  87638  83676  65796  69905  24460  25743  29704  73134  54317  15603
485973  46157  72714  12117  49822  89232  61929  56837  49436   2813  54533
30697   33648  78163  23685  44785   5668  52151  92729  91882  19013   9837
306669  44396  27537   8099  85680  11923  29968  51354  95255   7826  47832

### Intro sobre métodos de string

In [329]:
text = 'text'

In [330]:
# retornando o texto invertido
text[::-1]

'txet'

In [331]:
palindromo = 'apos a sopa'

In [332]:
# invertendo o palindromo
palindromo[::-1]

'apos a sopa'

In [333]:
text = 'texTO'
text.capitalize()

'Texto'

In [334]:
text.lower()

'texto'

In [335]:
text.upper()

'TEXTO'

In [336]:
# s.find(sub[, start[, end]]) -> int 
# método que retorna o index de onde está a string pesquisada, é case sensitive

text.find('x')

2

In [337]:
text[2]

'x'

In [338]:
# replace
text.replace('xTO', 'sta')

'testa'

## 5.5 Junções de tabelas

### Merge

In [339]:
import pandas as pd
import numpy as np

#### Left join

In [340]:
# dados para o dataframe

column_cliente = ['cliente_{}'.format(n) for n in range(1, 5)]

df1_dict = {
    'ID': column_cliente,
    'Sexo': ["M", "F", "F", "M"],
    'Idade': [27, 30, 24, 35],
    'Salario': [5000, 7000, 2700, 6500],
}

df2_dict = {
    "ID": column_cliente,
    'Compras_M1': [0, 200, 300, 1000],
    'Compras_M2': [1000, 800, 300, 2000],
}

In [341]:
df1 = pd.DataFrame(df1_dict)
df2 = pd.DataFrame(df2_dict)
df2

          ID  Compras_M1  Compras_M2
0  cliente_1           0        1000
1  cliente_2         200         800
2  cliente_3         300         300
3  cliente_4        1000        2000

In [342]:
df1

          ID Sexo  Idade  Salario
0  cliente_1    M     27     5000
1  cliente_2    F     30     7000
2  cliente_3    F     24     2700
3  cliente_4    M     35     6500

In [343]:
df1_col = list(df1.columns)
df1_rename = [col.upper() for col in df1_col]
df1.columns = df1_rename

df2_col = list(df2.columns)
df2_rename = [col.upper() for col in df2_col]
df2.columns = df2_rename

In [344]:
# merge with left join like SQL
df3_left_join = df1.merge(df2, on='ID', how='left')
df3_left_join = df3_left_join.set_index('ID')
df3_left_join

          SEXO  IDADE  SALARIO  COMPRAS_M1  COMPRAS_M2
ID
cliente_1    M     27     5000           0        1000
cliente_2    F     30     7000         200         800
cliente_3    F     24     2700         300         300
cliente_4    M     35     6500        1000        2000

In [345]:
# removendo uma linha do df2
df3 = df2.head(3)
df3

          ID  COMPRAS_M1  COMPRAS_M2
0  cliente_1           0        1000
1  cliente_2         200         800
2  cliente_3         300         300

In [346]:
# left join com dados faltantes do df3
df1.merge(df3, on='ID', how='left')

          ID SEXO  IDADE  SALARIO  COMPRAS_M1  COMPRAS_M2
0  cliente_1    M     27     5000         0.0      1000.0
1  cliente_2    F     30     7000       200.0       800.0
2  cliente_3    F     24     2700       300.0       300.0
3  cliente_4    M     35     6500         NaN         NaN

#### Right join

In [347]:
# merge with rigth join like SQL
df1.merge(df2, on='ID', how='right')

          ID SEXO  IDADE  SALARIO  COMPRAS_M1  COMPRAS_M2
0  cliente_1    M     27     5000           0        1000
1  cliente_2    F     30     7000         200         800
2  cliente_3    F     24     2700         300         300
3  cliente_4    M     35     6500        1000        2000

In [348]:
# right join com dados faltantes do df3
# nessa caso o df resultante fica com uma linha faltando porque 
# os dados da primeira tabela que vem não tem a última linha
df1.merge(df3, on='ID', how='right')

          ID SEXO  IDADE  SALARIO  COMPRAS_M1  COMPRAS_M2
0  cliente_1    M     27     5000           0        1000
1  cliente_2    F     30     7000         200         800
2  cliente_3    F     24     2700         300         300

#### Inner join

In [349]:
df4 = df1[df1['ID'] != 'cliente_3']

In [350]:
# inner join trazer a intersecção entre os dois 
# vai gerar um novo dataframe a partir da coluna passada como ID que exista nos dois dfs

df4.merge(df3, on='ID', how='inner')

          ID SEXO  IDADE  SALARIO  COMPRAS_M1  COMPRAS_M2
0  cliente_1    M     27     5000           0        1000
1  cliente_2    F     30     7000         200         800

#### Full outer join

In [351]:
# união dos dois dfs
# os dados que não existirem em uma dataframe ou outro ficaram vazios (NaN)
df4.merge(df3, on='ID', how='outer')

          ID SEXO  IDADE  SALARIO  COMPRAS_M1  COMPRAS_M2
0  cliente_1    M   27.0   5000.0         0.0      1000.0
1  cliente_2    F   30.0   7000.0       200.0       800.0
2  cliente_4    M   35.0   6500.0         NaN         NaN
3  cliente_3  NaN    NaN      NaN       300.0       300.0

### Concat

In [352]:
df_temp = pd.DataFrame({
    'ID': ['cliente_5', 'cliente_6'],
    'SEXO': ["M", "F"],
    'IDADE': [40, 50],
    'SALARIO': [10000, 17500]
})
df5 = df1.head(2)
df6 = df1.tail(2)

In [353]:
print(df_temp, end='\n\n')
print(df5, end='\n\n')
print(df6)

          ID SEXO  IDADE  SALARIO
0  cliente_5    M     40    10000
1  cliente_6    F     50    17500

          ID SEXO  IDADE  SALARIO
0  cliente_1    M     27     5000
1  cliente_2    F     30     7000

          ID SEXO  IDADE  SALARIO
2  cliente_3    F     24     2700
3  cliente_4    M     35     6500

In [354]:
# concatena as tabelas pelo indice
df_concat = pd.concat([df_temp, df5, df6], axis=0)
df_concat

          ID SEXO  IDADE  SALARIO
0  cliente_5    M     40    10000
1  cliente_6    F     50    17500
0  cliente_1    M     27     5000
1  cliente_2    F     30     7000
2  cliente_3    F     24     2700
3  cliente_4    M     35     6500

In [355]:
# concatena as tabelas sem se guiar pelo indice
pd.concat([df_temp, df5, df6], axis=1)

,ID,SEXO,IDADE,SALARIO,ID,SEXO,IDADE,SALARIO,ID,SEXO,IDADE,SALARIO
0,cliente_5,M,40.0,10000.0,cliente_1,M,27.0,5000.0,NaN,NaN,NaN,NaN
1,cliente_6,F,50.0,17500.0,cliente_2,F,30.0,7000.0,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,cliente_3,F,24.0,2700.0
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,cliente_4,M,35.0,6500.0

In [356]:
# acertando o indice da tabela
list_index = [int(value.split('_')[1]) for value in list(df_concat['ID'])]
list_index

[5, 6, 1, 2, 3, 4]

In [357]:
# criando a coluna indice
df_concat['INDEX'] = list_index

In [358]:
# setando a coluna criada como indice da tabela
df_concat = df_concat.set_index('INDEX')
df_concat

              ID SEXO  IDADE  SALARIO
INDEX
5      cliente_5    M     40    10000
6      cliente_6    F     50    17500
1      cliente_1    M     27     5000
2      cliente_2    F     30     7000
3      cliente_3    F     24     2700
4      cliente_4    M     35     6500

In [359]:
# ordenando tabela pela coluna indice
df_concat.sort_index()

              ID SEXO  IDADE  SALARIO
INDEX
1      cliente_1    M     27     5000
2      cliente_2    F     30     7000
3      cliente_3    F     24     2700
4      cliente_4    M     35     6500
5      cliente_5    M     40    10000
6      cliente_6    F     50    17500

In [360]:
# resentand a coluna indice para voltar a ordem anterior
df_concat.reset_index()

   INDEX         ID SEXO  IDADE  SALARIO
0      5  cliente_5    M     40    10000
1      6  cliente_6    F     50    17500
2      1  cliente_1    M     27     5000
3      2  cliente_2    F     30     7000
4      3  cliente_3    F     24     2700
5      4  cliente_4    M     35     6500

### Append

In [361]:
# resetando o indice
df_1 = df5.reset_index()
df_2 = df6.reset_index()
df_3 = df_temp.reset_index()

In [362]:
# removendo a coluna indice
df_1 = df_1.drop('index', 1)
df_2 = df_2.drop('index', 1)
df_3 = df_3.drop('index', 1)

/var/folders/wh/_2xtz5kd2knd10y0m8tmqhrc0000gp/T/ipykernel_17759/730727108.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  df_1 = df_1.drop('index', 1)
/var/folders/wh/_2xtz5kd2knd10y0m8tmqhrc0000gp/T/ipykernel_17759/730727108.py:2: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  df_2 = df_2.drop('index', 1)
/var/folders/wh/_2xtz5kd2knd10y0m8tmqhrc0000gp/T/ipykernel_17759/730727108.py:3: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  df_3 = df_3.drop('index', 1)

In [363]:
print(df_1, end='\n\n')
print(df_2, end='\n\n')
print(df_3, end='\n\n')

          ID SEXO  IDADE  SALARIO
0  cliente_1    M     27     5000
1  cliente_2    F     30     7000

          ID SEXO  IDADE  SALARIO
0  cliente_3    F     24     2700
1  cliente_4    M     35     6500

          ID SEXO  IDADE  SALARIO
0  cliente_5    M     40    10000
1  cliente_6    F     50    17500

In [366]:
# aplicando append, é um método mais prático de chamar o pd.concat
# sem a necessidade de passar o eixo

# TODO: MÉTODO VAI ENTRAR EM DESUSO

df_append = df_1.append([df_2, df_3])
df_append

/var/folders/wh/_2xtz5kd2knd10y0m8tmqhrc0000gp/T/ipykernel_17759/1452332487.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_append = df_1.append([df_2, df_3])

          ID SEXO  IDADE  SALARIO
0  cliente_1    M     27     5000
1  cliente_2    F     30     7000
0  cliente_3    F     24     2700
1  cliente_4    M     35     6500
0  cliente_5    M     40    10000
1  cliente_6    F     50    17500